In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('price_predictor_dataset.csv')

In [4]:
df.head()

,Unnamed: 0,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,0,Albania,Maize,1990,36613,1485,121.0,16.37,183065
1,1,Albania,Potatoes,1990,66667,1485,121.0,16.37,200001
2,2,Albania,"Rice, paddy",1990,23333,1485,121.0,16.37,139998
3,3,Albania,Sorghum,1990,12500,1485,121.0,16.37,50000
4,4,Albania,Soybeans,1990,7000,1485,121.0,16.37,56000

In [5]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [6]:
df.head()

,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,36613,1485,121.0,16.37,183065
1,Albania,Potatoes,1990,66667,1485,121.0,16.37,200001
2,Albania,"Rice, paddy",1990,23333,1485,121.0,16.37,139998
3,Albania,Sorghum,1990,12500,1485,121.0,16.37,50000
4,Albania,Soybeans,1990,7000,1485,121.0,16.37,56000

In [ ]:
df.drop('hg/ha_yield',axis=1,inplace=True) #axis=1 means This means the operation is performed along the columns

In [9]:
df.head()

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,1485,121.0,16.37,183065
1,Albania,Potatoes,1990,1485,121.0,16.37,200001
2,Albania,"Rice, paddy",1990,1485,121.0,16.37,139998
3,Albania,Sorghum,1990,1485,121.0,16.37,50000
4,Albania,Soybeans,1990,1485,121.0,16.37,56000

In [10]:
df.shape

(28242, 7)

In [11]:
df.isnull().sum()

Area                             0
Item                             0
Year                             0
average_rain_fall_mm_per_year    0
pesticides_tonnes                0
avg_temp                         0
Price                            0
dtype: int64

In [12]:
df.duplicated().sum()

2310

In [13]:
df.drop_duplicates(inplace=True)

In [14]:
df.duplicated().sum()

0

In [15]:
df.describe()

,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
count,25932.000000,25932.000000,25932.000000,25932.000000,2.593200e+04
mean,2001.556455,1146.836688,34782.573241,20.422251,2.001901e+05
std,7.055924,717.391098,57228.568244,6.439402,2.350081e+05
min,1990.000000,51.000000,0.040000,1.300000,0.000000e+00
25%,1995.000000,593.000000,1597.000000,16.580000,2.864400e+04
50%,2001.000000,1083.000000,15373.000000,21.420000,1.305520e+05
75%,2008.000000,1668.000000,45620.000000,26.060000,2.699640e+05
max,2013.000000,3240.000000,367778.000000,30.650000,1.504236e+06

In [16]:
def isStr(obj):
    try:
        float(obj)
        return False
    except:
        return True

In [17]:
to_drop=df[df['average_rain_fall_mm_per_year'].apply(isStr)].index

In [18]:
to_drop

Index([], dtype='int64')

In [19]:
df.drop(to_drop)

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,1485,121.00,16.37,183065
1,Albania,Potatoes,1990,1485,121.00,16.37,200001
2,Albania,"Rice, paddy",1990,1485,121.00,16.37,139998
3,Albania,Sorghum,1990,1485,121.00,16.37,50000
4,Albania,Soybeans,1990,1485,121.00,16.37,56000
...,...,...,...,...,...,...,...
28237,Zimbabwe,"Rice, paddy",2013,657,2550.07,19.76,135486
28238,Zimbabwe,Sorghum,2013,657,2550.07,19.76,12264
28239,Zimbabwe,Soybeans,2013,657,2550.07,19.76,105136
28240,Zimbabwe,Sweet potatoes,2013,657,2550.07,19.76,0
28241,Zimbabwe,Wheat,2013,657,2550.07,19.76,160216

In [22]:
mean_price=df[df['Price']!=0]['Price'].mean()
df['Price']=df['Price'].replace(0,mean_price)

In [25]:
hee=(df['Price']==0).any()
print(hee)

False